# YOLO12-obb (YOLO11n-scale aligned)
nc: 1
names: [ship]

# ======================
# Backbone
# ======================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [64, False, 0.25]] # 2
  - [-1, 1, Conv, [64, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [128, False, 0.25]]# 4
  - [-1, 1, Conv, [128, 3, 2]]       # 5-P4/16
  - [-1, 2, A2C2f, [128, True, 2]]   # 6
  - [-1, 1, Conv, [256, 3, 2]]       # 7-P5/32
  - [-1, 2, A2C2f, [256, True, 1]]   # 8

# ======================
# Head
# ======================
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 9
  - [[-1, 6], 1, Concat, [1]]                    # 10 (256 + 128)
  - [-1, 2, A2C2f, [128, False, -1]]             # 11 -> P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 4], 1, Concat, [1]]                    # 13 (128 + 128)
  - [-1, 2, A2C2f, [64, False, -1]]               # 14 -> P3

  - [-1, 1, Conv, [64, 3, 2]]                    # 15 P3 -> P4
  - [[-1, 11], 1, Concat, [1]]                   # 16 (64 + 128)
  - [-1, 2, A2C2f, [128, False, -1]]              # 17 -> P4

  - [-1, 1, Conv, [128, 3, 2]]                   # 18 P4 -> P5
  - [[-1, 8], 1, Concat, [1]]                    # 19 (128 + 256)
  - [-1, 2, C3k2, [256, True]]                   # 20 -> P5

  - [[14, 17, 20], 1, OBB, [nc, 1]]               # Detect(P3, P4, P5)
