names: [ ship ]
nc: 1

# scaled YOLO11n backbone (n-like width)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [64, False, 0.25]] # 2
  - [-1, 1, Conv, [64, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [128, False, 0.25]]# 4
  - [-1, 1, Conv, [128, 3, 2]]       # 5-P4/16
  - [-1, 2, C3k2, [128, True]]       # 6
  - [-1, 1, Conv, [256, 3, 2]]       # 7-P5/32
  - [-1, 2, C3k2, [256, True]]       # 8
  - [-1, 1, SPPF, [256, 5]]          # 9
  - [-1, 2, C2PSA, [256]]            # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                   # 12  (256 + 128 = 384)
  - [-1, 2, C3k2, [128, False]]                 # 13  -> P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                   # 15  (128 + 128 = 256)
  - [-1, 2, C3k2, [64, False]]                  # 16  -> P3/8

  - [-1, 1, Conv, [64, 3, 2]]                   # 17  P3 -> P4
  - [[-1, 13], 1, Concat, [1]]                  # 18  (64 + 128 = 192)
  - [-1, 2, C3k2, [128, False]]                 # 19  -> P4/16

  - [-1, 1, Conv, [128, 3, 2]]                  # 20  P4 -> P5
  - [[-1, 10], 1, Concat, [1]]                  # 21  (128 + 256 = 384)
  - [-1, 2, C3k2, [256, True]]                  # 22  -> P5/32

  - [[16, 19, 22], 1, OBB, [nc, 1]]             # Detect(P3, P4, P5)
